YOLO_CLASSES = [
        "감자튀김",      # 0
        "고등어구이",    # 1
        "군만두",        # 2
        "김밥",          # 3
        "김치찌개",      # 4
        "까르보나라",    # 5
        "달걀찜",        # 6
        "닭가슴살샐러드", # 7
        "닭갈비",        # 8
        "닭찜",          # 9
        "돼지갈비찜",    # 10
        "된장찌개",      # 11
        "등심스테이크",  # 12
        "떡갈비",        # 13
        "떡국",          # 14
        "떡볶이",        # 15
        "라면",          # 16
        "마늘장아찌",    # 17
        "만두",          # 18
        "미역국",        # 19
        "배추김치",      # 20
        "부대찌개",      # 21
        "비빔냉면",      # 22
        "비빔밥",        # 23
        "삼겹살구이",    # 24
        "삼계탕",        # 25
        "숙주나물",      # 26
        "순대",          # 27
        "순대볶음",      # 28
        "순두부찌개",    # 29
        "순살치킨",      # 30
        "스크램블드에그", # 31
        "쌀국수",        # 32
        "아귀찜",        # 33
        "알밥",          # 34
        "에그타르트",    # 35
        "오이김치"       # 36
    ]

YOLO_CLASSES_58 = []

TARGET_CLASSES123 = [
        "닭갈비", "훈제오리", "콩나물", "찹쌀떡", "쌀국수", "비빔밥", "연어초밥", "장어초밥",
        "순대볶음", "참치샌드위치", "김치찌개", "부대찌개", "순대", "초콜릿", "순살치킨",
        "에그타르트", "치킨너겟", "고등어구이", "등심스테이크", "삼겹살구이", "조미김",
        "미역국", "삼계탕", "어묵국", "배추김치", "오이김치", "숙주나물", "군만두", "떡국",
        "라면", "만두", "비빔냉면", "짜장면", "짬뽕", "김밥", "비빔밥", "알밥", "오므라이스",
        "육회비빔밥", "떡볶이", "잡채", "닭가슴살샐러드", "육회", "마늘장아찌", "떡갈비",
        "스크램블드에그", "채소죽", "된장찌개", "부대찌개", "순두부찌개", "달걀찜", "닭찜",
        "돼지갈비찜", "순대", "아귀찜", "족발", "감자튀김", "오징어튀김", "치킨너겟",
        "후라이드치킨", "까르보나라", "츄러스", "초코아이스크림"
    ]

MOBILENET_CLASSES_1 = [
    "감자튀김", "고등어구이", "군만두", "김밥", "김치찌개", "까르보나라", "달걀찜", "닭가슴살샐러드", "닭갈비", "닭찜",
    "돼지갈비찜", "된장찌개", "등심스테이크", "떡갈비", "떡국", "떡볶이", "라면", "마늘장아찌", "만두", "미역국",
    "배추김치", "부대찌개", "비빔냉면", "비빔밥", "삼겹살구이", "삼계탕", "숙주나물", "순대", "순대볶음", "순두부찌개",
    "순살치킨", "스크램블드에그", "쌀국수", "아귀찜", "알밥", "어묵국", "에그타르트", "연어초밥", "오므라이스", "오이김치",
    "오징어튀김", "육회", "육회비빔밥", "잡채", "장어초밥", "조미김", "족발", "짜장면", "짬뽕", "참치샌드위치",
    "찹쌀떡", "채소죽", "초코아이스크림", "초콜릿", "츄러스", "치킨너겟", "콩나물", "후라이드치킨", "훈제오리"
]

MOBILENET_CLASSES = [
    "가래떡", "가지", "가지구이", "가츠동", "간장", "갈비구이", "갈비찜", "감", "감귤주스", "감자구이",
    "감자그라탕", "감자볶음", "감자샐러드", "감자스프", "감자칩", "감자튀김", "거봉포도", "건자두", "건크랜베리", "건포도",
    "게맛살", "게장", "겨자소스", "경단", "고갈비", "고구마", "고등어", "고등어구이", "고로케", "곱창전골",
    "과일통조림", "군만두", "그라탕", "그린올리브", "김", "김구이", "김마끼", "김밥", "김치국", "김치볶음밥",
    "김치찌개", "까르보나라", "까망베르치즈", "깐풍기", "껌", "꼬막", "꿀", "나가사끼짬뽕", "나시고랭", "낚지볶음",
    "낫또", "냉면", "냉채족발", "노랑파프리카", "녹색피망", "녹즙", "누텔라", "느타리버섯", "다시마", "다크초콜릿",
    "단감", "단호박", "달걀", "달걀볶음밥", "달걀비빔밥", "달걀샌드위치", "달걀찜", "달걀후라이", "닭가슴살", "닭가슴살구이",
    "닭가슴살샐러드", "닭가슴살시저샐러드", "닭갈비", "닭갈비구이", "닭강정", "닭고기", "닭고기볶음", "닭날개", "닭날개양념구이", "닭발",
    "닭살채소두반장볶음", "닭살채소볶음", "닭찜", "닭훈제구이", "당근", "당근주스", "당근케이크", "대추", "대파", "데리야끼치킨",
    "데친두부", "도넛", "도리아", "돼지갈비찜", "돼지감자", "돼지고기고추장불고기", "돼지고기구이", "돼지고기스테이크", "된장국", "된장찌개",
    "두부", "두부튀김", "두유", "등심스테이크", "딤섬", "딸기", "딸기라떼", "딸기맛 우유", "딸기아이스크림", "땅콩버터",
    "떡갈비", "떡국", "떡만두국,고기만두", "떡볶이", "똠양꿍", "라따뚜이", "라떼", "라멘", "라면", "라자냐",
    "랍스타", "레드와인", "레모네이드", "레몬", "로메인상추", "롤", "롤케이크", "리조또", "리코타치즈", "마",
    "마늘", "마늘구이", "마늘장아찌", "마들렌", "마르게리타피자", "마른오징어", "마시멜로우", "마요네즈", "마카로니샐러드", "마테차",
    "막걸리", "막대사탕", "만두", "만두국", "망고", "매실", "맥주", "머핀", "메밀", "메쉬드포테이토",
    "멜론", "명란젓", "모듬초밥", "모듬튀김", "모듬회", "모짜렐라치즈", "무김치", "무우", "문어", "물미역",
    "뮤즐리", "미소라멘", "미소장국", "미역국", "미역나물", "미트볼", "밀감", "밀크초콜릿", "바게트빵", "바나나",
    "바나나우유", "바나나칩", "바닐라아이스크림", "바람떡", "바베큐치킨", "바질", "밤", "밥", "방울토마토", "배추",
    "배추김치", "백도", "백향과", "버섯", "버섯 장아찌", "버터", "버터쿠키", "번데기", "베이글", "베이글샌드위치",
    "베이컨", "베이컨구이", "베이컨피자", "보리빵", "보쌈", "보이차", "복숭아", "볶은원두", "볶음면", "볶음밥",
    "볶음쌀국수", "봉골레파스타", "부대찌개", "부침개", "북어국", "붕어빵", "브라우니", "브로컬리계란찜", "브로콜리", "블랙커피",
    "블루베리", "비빔국수", "비빔냉면", "비빔밥", "비엔나소시지", "빵", "뻥튀기", "사과", "사과샐러드", "사과주스",
    "사과파이", "사이다", "사탕", "산딸기", "살구", "살사소스", "삶은 고구마", "삶은달걀", "삼겹살", "삼겹살구이",
    "삼계탕", "상추", "새싹샐러드", "새우", "새우구이", "새우딤섬", "새우만두", "새우매운탕", "새우볶음밥", "새우튀김",
    "샌드위치", "생강차", "생과일주스", "생선구이", "생선찌개", "생선초밥", "생선튀김", "생선회", "생크림", "생크림케이크",
    "석류", "설탕", "센베이", "셀러리", "소고기육포", "소금", "소면", "소시지", "소시지구이", "솜사탕",
    "쇠고기구이", "쇠고기볶음", "수박", "수박주스", "숙주나물", "순대", "순대볶음", "순두부찌개", "순살치킨", "쉐이크",
    "스크램블드에그", "스테이크", "스튜", "스트링치즈", "스파게티", "스파게티면", "스프", "슬라이스치즈", "시금치", "시럽",
    "시루떡", "시리얼", "시리얼바", "쌀과자", "쌀국수", "아귀찜", "아몬드", "아스파라거스구이", "아이스커피", "아포가토",
    "알밥", "알타리김치", "애플민트", "애호박", "액상요구르트", "앵두", "야끼소바", "야채볶음", "양꼬치", "양념치킨",
    "양배추", "양배추샐러드", "양배추쌈", "양배추절임", "양상추샐러드", "양주", "양파", "양파샐러드", "양파튀김", "어묵국",
    "어묵탕", "어육소시지", "에그타르트", "연근", "연어구이", "연어롤", "연어샐러드", "연어초밥", "연어회", "오디",
    "오렌지", "오렌지주스", "오리구이", "오리로스구이", "오므라이스", "오믈렛", "오미자", "오븐구이치킨몸통", "오이", "오이김치",
    "오이샐러드", "오이피클", "오징어", "오징어튀김", "오코노미야끼", "오트밀", "옥수수스프", "완탕", "왕돈가스", "왕만두",
    "요구르트", "육회", "육회비빔밥", "은행", "자몽", "자몽주스", "잡곡식빵", "잡채", "잣", "장어구이",
    "장어덮밥", "장어초밥", "적양배추", "전복", "절임배추", "젤리", "조미김", "족발", "주먹밥", "주스",
    "죽", "짜장면", "짬뽕", "쨈빵", "쪽갈비구이", "쭈꾸미볶음", "찐빵", "참깨", "참외", "참치샌드위치",
    "참치통조림", "참치회", "찹쌀떡", "채소죽", "천도복숭아", "청포도", "체다치즈", "체리", "초밥", "초코머핀",
    "초코바", "초코아이스크림", "초코우유", "초코케이크", "초코쿠키", "초콜릿", "추어탕", "춘권", "츄러스", "치즈",
    "치즈볼", "치즈빵", "치즈스틱", "치즈피자", "치커리", "치킨너겟", "치킨스테이크", "칠리소스", "카나페", "카라멜",
    "카레소스", "카카오닙스", "카페라떼", "카푸치노", "카프레제샐러드", "캐슈넛", "커스터드크림", "커피", "케일", "케첩",
    "코코아", "콜라비", "콩국수", "콩나물", "콩샐러드", "쿠키", "퀘사디아", "크래커", "크랜베리", "크레페",
    "크로와상", "크림치즈", "키위", "탄산음료", "토마토", "토마토샐러드", "토마토주스", "토마토파스타소스", "토스트", "통닭",
    "통밀빵", "티라미수", "파니니", "파닭", "파스타", "파슬리", "파인애플", "파전", "파파야", "파프리카",
    "파프리카노랑", "파프리카빨강", "팝콘", "팟타이", "팥", "팥빙수", "팽이버섯", "페퍼로니피자", "펜네파스타", "포도",
    "폭립", "표고버섯", "푸딩", "프레즐", "프렌치토스트", "피망", "피스타치오", "피자", "피칸", "하와이안피자",
    "할라피뇨", "핫윙", "해물찜", "해물탕", "해삼", "해장국", "호두과자", "호두파이", "호밀빵", "호박씨",
    "홍차", "화덕피자", "화이트와인", "회오리감자", "후라이드치킨", "후라이드치킨다리", "후랑크소시지", "후렌치후라이", "후추", "훈제연어",
    "훈제오리", "훈제오리샐러드", "훈제치킨", "흰죽"
]

#모델에 사용될 음식 클래스 목록 리턴 함수
def get_mobilenet_classes(type: str = "YOLO"):
    
    if type == "YOLO":
        # YOLO 모델에서 사용하는 클래스 목록
        return YOLO_CLASSES
    elif type == "MOBILENET_1":
        # MOBILENET_1 모델에서 사용하는 클래스 목록
        return MOBILENET_CLASSES_1
    else :
        return MOBILENET_CLASSES


    return MOBILENET_CLASSES

def get_class_name_by_index(index):
    """
    인덱스를 통해 음식 클래스 이름을 반환합니다.
    
    Args:
        index (int): 클래스 인덱스
        
    Returns:
        str: 음식 클래스 이름
    """
    if 0 <= index < len(MOBILENET_CLASSES):
        return MOBILENET_CLASSES[index]
    else:
        return None

def get_index_by_class_name(class_name):
    """
    음식 클래스 이름을 통해 인덱스를 반환합니다.
    
    Args:
        class_name (str): 음식 클래스 이름
        
    Returns:
        int: 클래스 인덱스, 없으면 -1
    """
    try:
        return MOBILENET_CLASSES.index(class_name)
    except ValueError:
        return -1